app/Http/Controllers/Auth/RegisterStudentController.php

select * from `departments` where `departments`.`faculty_id` in (1, 2, 3, 4)
select * from `faculties` where `active` = 1
select * from `departments` where `active` = 1 order by `nom` asc
---
    public function create()
    {
        $faculties   = Faculty::with('departments')->where('active', true)->get();
        $departments = Department::where('active', true)->orderBy('nom')->get();