app/Http/Controllers/Auth/RegisterTeacherController.php

    public function create()
    {
        $faculties   = Faculty::with('departments')->where('active', true)->get();
        $departments = Department::where('active', true)->orderBy('nom')->get();
---
select * from `departments` where `departments`.`faculty_id` in (1, 2, 3, 4)
select * from `faculties` where `active` = 1
select * from `departments` where `active` = 1 order by `nom` asc

    public function store(RegisterTeacherRequest $request)
    {
        DB::transaction(function () use ($request) {

            // 1. Traitement photo
            $photoPath = null;
            if ($request->hasFile('photo')) {
                $photoPath = $this->processPhoto($request->file('photo'));
            }

            // 2. Stockage carte professionnelle
            $cartePath = $request->file('carte_professionnelle')
                ->store('cartes/enseignants', 'public');

            // 3. Création compte utilisateur
            $user = User::create([
                'name'       => $request->prenom . ' ' . $request->nom,
                'email'      => $request->email,
                'identifier' => $request->matricule_pro,
                'password'   => Hash::make($request->password),
                'status'     => 'pending',
                'role_type'  => 'teacher',
            ]);

            // 4. Attribution du rôle
            $user->assignRole('teacher');

            // 5. Création profil enseignant
            Teacher::create([
                'user_id'               => $user->id,
                'department_id'         => $request->department_id,
                'matricule_pro'         => $request->matricule_pro,
                'nom'                   => $request->nom,
                'prenom'                => $request->prenom,
                'grade'                 => $request->grade,
                'specialite'            => $request->specialite,
                'telephone'             => $request->telephone,
                'adresse'               => $request->adresse,
                'photo'                 => $photoPath,
                'carte_professionnelle' => $cartePath,
            ]);
---
insert into `users` (`name`, `email`, `identifier`, `password`, `status`, `role_type`, `updated_at`, `created_at`) values ('amavi koffi', 'afanouerwin@gmail.com', 'ENS2026001', '$2y$12$rD0Yq3eqCpXs4SINMVY88.6aUluziw0/2yYHSCJD30HDkjycyYHL.', 'pending', 'teacher', '2026-06-21 12:35:12', '2026-06-21 12:35:12')
insert into `teachers` (`user_id`, `department_id`, `matricule_pro`, `nom`, `prenom`, `grade`, `specialite`, `telephone`, `adresse`, `photo`, `carte_professionnelle`, `updated_at`, `created_at`) values (5, '1', 'ENS2026001', 'koffi', 'amavi', 'Professeur', null, '+22890235929', 'Lomé', null, 'cartes/enseignants/ytTrtqyHCJgQGur8TnFkkj0obhHhogH7NHHlvs9E.jpg', '2026-06-21 12:35:12', '2026-06-21 12:35:12')