app/Services/AuthService.php

select * from `users` where `email` = 'ENS0001' or `identifier` = 'ENS0001' limit 1
---
    public function attempt(string $identifier, string $password): array
    {
        // Cherche l'utilisateur par email OU par identifier
        $user = User::where('email', $identifier)
                    ->orWhere('identifier', $identifier)
                    ->first();