app/Http/Controllers/Librarian/DashboardController.php

select count(*) as aggregate from `loans` where date(`date_retour_effective`) = '2026-06-29'
select count(*) as aggregate from `loans` where `statut` = 'en_retard'
select sum(`montant`) as aggregate from `penalties` where `statut` = 'impayee'
select count(*) as aggregate from `users` where date(`created_at`) = '2026-06-29'
select count(*) as aggregate from `books` where `quantite_disponible` > 0
select * from `book_copies` where `book_copies`.`id` in (4)
select * from `books` where `books`.`id` in (3)
select * from `loans` order by `created_at` desc limit 8
select * from `users` where `users`.`id` in (2)
select * from `loans` where `statut` = 'en_retard' or (`statut` = 'actif' and `date_retour_prevue` < '2026-06-29 06:31:58') order by `created_at` desc limit 10
---
    public function index()
    {
        $stats = [
            'emprunts_jour'     => Loan::whereDate('created_at', today())->count(),
            'retours_jour'      => Loan::whereDate('date_retour_effective', today())->count(),
            'en_retard'         => Loan::where('statut', 'en_retard')->count(),
            'penalites_dues'    => Penalty::where('statut', 'impayee')->sum('montant'),
            'nouveaux_inscrits' => User::whereDate('created_at', today())->count(),
            'livres_dispo'      => Book::where('quantite_disponible', '>', 0)->count(),
        ];

        $emprunts_recents = Loan::with(['user', 'bookCopy.book'])
            ->latest()
            ->limit(8)
            ->get();

        $emprunts_retard = Loan::with(['user', 'bookCopy.book'])
            ->where('statut', 'en_retard')
            ->orWhere(function($q) {
                $q->where('statut', 'actif')
                  ->where('date_retour_prevue', '<', now());
            })
            ->latest()
            ->limit(10)
            ->get();