app/Http/Controllers/Librarian/LoanController.php

    public function index()
    {
        $loans = Loan::with(['user', 'bookCopy.book'])
            ->whereIn('statut', ['actif', 'en_retard', 'renouvele'])
            ->latest()
            ->paginate(20);

        $stats = [
            'actifs'    => Loan::where('statut', 'actif')->count(),
            'en_retard' => Loan::where('statut', 'en_retard')->count(),
            'renouvele' => Loan::where('statut', 'renouvele')->count(),
            'total'     => Loan::count(),
        ];
---
select * from `book_copies` where `book_copies`.`id` in (4)
select * from `books` where `books`.`id` in (3)
select * from `loans` where `statut` in ('actif', 'en_retard', 'renouvele') order by `created_at` desc limit 20 offset 0
select * from `users` where `users`.`id` in (2)
select count(*) as aggregate from `loans` where `statut` = 'actif'
select count(*) as aggregate from `loans` where `statut` = 'en_retard'
select count(*) as aggregate from `loans` where `statut` = 'renouvele'
select count(*) as aggregate from `loans`

    public function show(Loan $loan)
    {
        $loan->load(['user', 'bookCopy.book', 'penalty']);
---
select * from `book_copies` where `book_copies`.`id` in (5)
select * from `books` where `books`.`id` in (3)
select * from `penalties` where `penalties`.`loan_id` in (2)
select * from `users` where `users`.`id` in (2)