app/Http/Controllers/Librarian/PenaltyController.php

select * from `book_copies` where `book_copies`.`id` in (5, 6)
select * from `books` where `books`.`id` in (3)
select * from `loans` where `loans`.`id` in (3, 4)
select * from `penalties` order by `created_at` desc limit 15 offset 0
select sum(`montant`) as aggregate from `penalties` where `statut` = 'impayee'
select sum(`montant`) as aggregate from `penalties` where `statut` = 'payee'
select count(*) as aggregate from `penalties` where `statut` = 'impayee'
select count(*) as aggregate from `penalties` where `statut` = 'payee'
---
    public function index(Request $request)
    {
        $query = Penalty::with('user', 'loan.bookCopy.book');

        if ($request->filled('date')) {
            $query->whereDate('created_at', $request->date);
        }
        if ($request->filled('month')) {
            $month = explode('-', $request->month);
            $query->whereMonth('created_at', $month[1])
                ->whereYear('created_at', $month[0]);
        }
        if ($request->filled('year')) {
            $query->whereYear('created_at', $request->year);
        }
        if ($request->filled('statut')) {
            $query->where('statut', $request->statut);
        }

        $penalties = $query->latest()->paginate(15);

        $stats = [
            'total_impayees' => Penalty::where('statut', 'impayee')->sum('montant'),
            'total_payees' => Penalty::where('statut', 'payee')->sum('montant'),
            'nb_impayees' => Penalty::where('statut', 'impayee')->count(),
            'nb_payees' => Penalty::where('statut', 'payee')->count(),
        ];