app/Http/Controllers/Student/DashboardController.php

    public function index()
    {
        $user = auth()->user();

        $stats = [
            'emprunts_actifs' => Loan::where('user_id', $user->id)
                ->whereIn('statut', ['actif', 'en_retard', 'renouvele'])->count(),
            'emprunts_total'  => Loan::where('user_id', $user->id)->count(),
            'penalites'       => Penalty::where('user_id', $user->id)
                ->where('statut', 'impayee')->sum('montant'),
            'reservations'    => Reservation::where('user_id', $user->id)
                ->where('statut', 'en_attente')->count(),
        ];

        // Emprunts actifs
        $emprunts = Loan::with('bookCopy.book')
            ->where('user_id', $user->id)
            ->whereIn('statut', ['actif', 'en_retard', 'renouvele'])
            ->latest()
            ->get();

        // Historique
        $historique = Loan::with('bookCopy.book')
            ->where('user_id', $user->id)
            ->whereIn('statut', ['retourne', 'perdu'])
            ->latest()
            ->limit(10)
            ->get();
---
select count(*) as aggregate from `loans` where `user_id` = 2 and `statut` in ('actif', 'en_retard', 'renouvele')
select count(*) as aggregate from `loans` where `user_id` = 2
select sum(`montant`) as aggregate from `penalties` where `user_id` = 2 and `statut` = 'impayee'
select count(*) as aggregate from `reservations` where `user_id` = 2 and `statut` = 'en_attente'
select * from `book_copies` where `book_copies`.`id` in (4)
select * from `books` where `books`.`id` in (3)
select * from `loans` where `user_id` = 2 and `statut` in ('actif', 'en_retard', 'renouvele') order by `created_at` desc
select * from `book_copies` where `book_copies`.`id` in (5)
select * from `loans` where `user_id` = 2 and `statut` in ('retourne', 'perdu') order by `created_at` desc limit 10