app/Http/Controllers/Teacher/DashboardController.php

select count(*) as aggregate from `loans` where `user_id` = 3 and `statut` in ('actif', 'en_retard', 'renouvele')
select count(*) as aggregate from `loans` where `user_id` = 3
select count(*) as aggregate from `reservations` where `user_id` = 3 and `statut` = 'en_attente'
select * from `loans` where `user_id` = 3 and `statut` in ('actif', 'en_retard', 'renouvele') order by `created_at` desc
select * from `loans` where `user_id` = 3 and `statut` in ('retourne', 'perdu') order by `created_at` desc limit 10
---
    public function index()
    {
        $user = auth()->user();

        $stats = [
            'emprunts_actifs' => Loan::where('user_id', $user->id)
                ->whereIn('statut', ['actif', 'en_retard', 'renouvele'])->count(),
            'emprunts_total'  => Loan::where('user_id', $user->id)->count(),
            'reservations'    => Reservation::where('user_id', $user->id)
                ->where('statut', 'en_attente')->count(),
        ];

        $emprunts = Loan::with('bookCopy.book')
            ->where('user_id', $user->id)
            ->whereIn('statut', ['actif', 'en_retard', 'renouvele'])
            ->latest()
            ->get();

        $historique = Loan::with('bookCopy.book')
            ->where('user_id', $user->id)
            ->whereIn('statut', ['retourne', 'perdu'])
            ->latest()
            ->limit(10)
            ->get();