app/Livewire/BookSearch.php

    public function render()
    {
        $query = Book::with(['author', 'category'])
            ->where('active', true);

        if ($this->search) {
            $query->where(function ($q) {
                $q->where('titre', 'like', '%' . $this->search . '%')
                  ->orWhere('isbn', 'like', '%' . $this->search . '%')
                  ->orWhereHas('author', function ($q2) {
                      $q2->where('nom', 'like', '%' . $this->search . '%')
                         ->orWhere('prenom', 'like', '%' . $this->search . '%');
                  });
            });
        }

        if ($this->category) {
            $query->where('category_id', $this->category);
        }

        if ($this->langue) {
            $query->where('langue', $this->langue);
        }

        if ($this->disponible === '1') {
            $query->where('quantite_disponible', '>', 0);
        } elseif ($this->disponible === '0') {
            $query->where('quantite_disponible', 0);
        }

        $books      = $query->latest()->paginate(12);
        $categories = Category::orderBy('nom')->get();
        $langues    = Book::distinct()->pluck('langue')->sort();
---
select * from `authors` where `authors`.`id` in (1)
select * from `books` where `active` = 1 order by `created_at` desc limit 12 offset 0
select * from `categories` where `categories`.`id` in (1)
select count(*) as aggregate from `books` where `active` = 1
select * from `categories` order by `nom` asc
select distinct `langue` from `books`