app/Http/Controllers/Admin/AuthorController.php

    public function index()
    {
        $authors = Author::withCount('books')->orderBy('nom')->paginate(20);
---
select count(*) as aggregate from `authors`