app/Http/Controllers/Admin/BookController.php

select * from `authors` where `authors`.`id` in (1)
select * from `books` order by `created_at` desc limit 20 offset 0
select * from `categories` where `categories`.`id` in (1)
select count(*) as aggregate from `books`
select count(*) as aggregate from `books` where `quantite_disponible` = 0
---
    public function index()
    {
        $books = Book::with(['author', 'category'])
            ->latest()
            ->paginate(20);

        $stats = [
            'total'       => Book::count(),
            'disponibles' => Book::where('quantite_disponible', '>', 0)->count(),
            'epuises'     => Book::where('quantite_disponible', 0)->count(),
        ];

select * from `authors` where `authors`.`id` in (1)
select * from `book_copies` where `book_copies`.`book_id` in (3)
select * from `categories` where `categories`.`id` in (1)
---
    public function show(Book $book)
    {
        $book->load(['author', 'category', 'copies']);