app/Http/Controllers/Admin/CategoryController.php

    public function index()
    {
        $categories = Category::withCount('books')
            ->whereNull('parent_id')
            ->with('children')
            ->orderBy('nom')
            ->paginate(20);
---
select * from `categories` where `categories`.`parent_id` in (1, 2, 3, 4, 5)
select count(*) as aggregate from `categories` where `parent_id` is null