app/Http/Controllers/Admin/DashboardController.php

    public function index()
    {
        // Statistiques principales
        $stats = [
            'total_books'      => Book::count(),
            'total_students'   => Student::count(),
            'total_teachers'   => Teacher::count(),
            'pending_accounts' => User::where('status', 'pending')->count(),
            'available_books'  => Book::where('quantite_disponible', '>', 0)->count(),
            'borrowed_books'   => Book::where('quantite_disponible', 0)->count(),
        ];

        // Inscriptions des 6 derniers mois
        $registrations = User::select(
                DB::raw('MONTH(created_at) as month'),
                DB::raw('YEAR(created_at) as year'),
                DB::raw('COUNT(*) as total')
            )
            ->where('created_at', '>=', now()->subMonths(6))
            ->groupBy('year', 'month')
            ->orderBy('year')
            ->orderBy('month')
            ->get();
---
select count(*) as aggregate from `students`
select count(*) as aggregate from `teachers`
select count(*) as aggregate from `users` where `status` = 'pending'
select count(*) as aggregate from `books` where `quantite_disponible` = 0
select MONTH(created_at) as month, YEAR(created_at) as year, COUNT(*) as total from `users` where `created_at` >= '2026-01-04 02:26:51' group by `year`, `month`

        }

        // Livres par catégorie
        $booksByCategory = Category::withCount('books')
            ->having('books_count', '>', 0)
            ->orderByDesc('books_count')
            ->limit(6)
            ->get();

        // Comptes par statut
        $accountStats = [
            'approved'  => User::where('status', 'approved')->count(),
            'pending'   => User::where('status', 'pending')->count(),
            'rejected'  => User::where('status', 'rejected')->count(),
            'suspended' => User::where('status', 'suspended')->count(),
        ];

        // Dernières inscriptions
        $recentUsers = User::where('status', 'pending')
            ->latest()
            ->limit(5)
            ->get();
---
select `categories`.*, (select count(*) from `books` where `categories`.`id` = `books`.`category_id`) as `books_count` from `categories` having `books_count` > 0 order by `books_count` desc limit 6
select count(*) as aggregate from `users` where `status` = 'suspended'
select * from `users` where `status` = 'pending' order by `created_at` desc limit 5