app/Http/Controllers/Admin/LibrarianController.php

    public function index()
    {
        $librarians = Librarian::with('user')->latest()->paginate(15);
---
select count(*) as aggregate from `librarians`