app/Http/Controllers/Admin/UserValidationController.php

    public function index()
    {
        $pending = User::with(['students.department.faculty', 'teachers.department.faculty'])
            ->where('status', 'pending')
            ->latest()
            ->paginate(15);

        $stats = [
            'pending'   => User::where('status', 'pending')->count(),
            'approved'  => User::where('status', 'approved')->count(),
            'rejected'  => User::where('status', 'rejected')->count(),
            'suspended' => User::where('status', 'suspended')->count(),
        ];
---
select * from `departments` where `departments`.`id` in (1)
select * from `faculties` where `faculties`.`id` in (1)
select * from `students` where `students`.`user_id` in (2, 4)
select * from `teachers` where `teachers`.`user_id` in (2, 4)
select count(*) as aggregate from `users` where `status` = 'pending'
select count(*) as aggregate from `users` where `status` = 'approved'
select count(*) as aggregate from `users` where `status` = 'rejected'
select count(*) as aggregate from `users` where `status` = 'suspended'

    public function show(User $user)
    {
        $user->load(['students.department.faculty', 'teachers.department.faculty', 'roles']);
---
select * from `students` where `students`.`user_id` in (102)
select * from `teachers` where `teachers`.`user_id` in (102)